Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON ID>EN Who's Mr. President.tmx
Source language: id
Languages: en

source: Kau pikir
en: You thought

source: OSIS MEREKA.
en: Identity.

source: KHAWATIR!!
en: worried!

source: PERLU BUKTI, AKU
en: I can give it

source: MEREKA MEMANG BERKERABAT, MARGA MEREKA SAMA.
en: they’re related because they share the same surname.

source: MENGIYAKAN?
en: or not?!

source: …PAK NEV
en: Well... It’s an

source: UNTUK SAAT INI, KITA AKAN IKUTI KEMAUAN PELAKU.
en: for now, we’ll listen to what the culprit wants.

source: YA.
en: Yes.

source: AKRAB…
en: close.

source: DICURIGAI.
en: any unnecessary suspicion since...

source: "KALAU BEGITU
en: “Then,

source: A-AKU HANYA TIDAK MAU KEJADIAN LEO TERULANG LAGI, JADI AKU EKSTRA WASPADA!
en: I-I just didn’t want that incident with leo to happen again, so I was just being extra cautious!

source: GRMBL
en: mumble

source: AKU BERSYUKUR
en: I’m so grateful

source: BERTEMU DENGAN
en: talk

source: KECELAKAAN KARENA
en: involved in an accident

source: MENEMPATKAN
en: assigned

source: …Aku tahu,
en: ...I know,

source: MENUNJUK AKU?
en: at me?

source: SAYA JUGA TELAH
en: I’ve also

source: aku tidak
en: I didn’t

source: ...SEHARUSNYA AKU BERSYUKUR SEKARANG,
en: I should be grateful now...

source: PERASAAN,
en: Ezra.

source: MEMENUHI KUALIFIKASI
en: to be a

source: Di sekolah seluas ini!??
en: this school is quite large, isn’t it?

source: Dan sekarang kami disekap di tempat yang entah di mana ini!!
en: and now we’re locked up in god knows where!!!

source: SITUASI TERASA
en: been peculiar

source: MEMBUAT ADLIB*
en: If you wanna do an ad-lib*,

source: S-SAYA INGIN
en: I’d like

source: …SEJAK TADI
en: Chiara hasn’t

source: KERJA
en: G-good

source: Kalau dipikir-pikir, dua pria tadi menghampiriku seolah seperti memang sudah menungguku…
en: come to think of it, those men approached me as if they’d been waiting for me.

source: Kamu satu-satunya orang yang bisa berkomunikasi dengan orang itu, jadi tidak ada pilihan lain.
en: you’re the only one who can talk to them so we don’t have any other option.

source: TIDAK AKAN TERLALU
en: won’t raise

source: SAYA TAHU SAYA MASIH
en: I know that I’m

source: E-EEH!!??
en: H-huh???

source: ORANG LAIN, TAPI
en: with some other girls,

source: NAOMI SUDAH
en: Naomi said that

source: TIDAK TAHU, TAPI
en: you didn’t know,

source: KAMI TIDAK
en: we didn’t

source: SAYA MEMBERIKAN
en: I have

source: MASA DEPANKU
en: my bleak

source: IG | @artfoliosms
en: instagram | @artfoliosms

source: KAMU KETAHUI.
en: about this.

source: A-APA
en: Wh-what

source: BIAR AKU YANG CARI
en: who investigates

source: TAPI AKU
en: But, I

source: Bagaimana situasinya?
en: how is it?

source: DIA BERNIAT
en: You want to

source: AKU HANYA MEMBERI
en: I was just giving her

source: BILANG DIA SUDAH
en: want to tell me that

source: KALAU AKU
en: I’m

source: YANG SURAM.
en: future.

source: TAPI ANEH…
en: This is peculiar...

source: MEMILIKI SISTEM OSIS
en: has a unique

source: DARI SEKOLAH SENDIRI.
en: from a school official, like you.

source: T-Tangan Cantika sakit sekali…
en: m-my hands hurt...

source: Mereka harus keluar sendiri-sendiri supaya tidak mencurigakan.
en: they have to go one by one to avoid suspicion.

source: TUGASKU SUDAH
en: I’ve finished

source: EZRA DAN TEMAN-TEMANMU?
en: Ezra and your friends?

source: C-CHIARA!!
en: Ch-Chiara!

source: SEDIKIT SAJA!!??
en: for once, naomi?!

source: SALING MEMAHAMI,
en: each other,

source: Karena itu mereka tidak mirip.
en: that explains why they don’t look alike physically.

source: (Suara teriakan tertahan)
en: (muffled scream)

source: Kok jadi begitu..!?
en: are you serious?!

source: *lagi-lagi bohong
en: *another lie

source: BERPURA-PURALAH PERCAYA DENGAN SEMUA PERKATAAN LEO,
en: you’ll just have to pretend that you believe everything leo says,

source: SEKRETARIS I & II
en: Secretary I & II

source: Ceritanya, Chiara sedang break syuting.
en: Chiara is on a break.

source: TAPI TIDAK,
en: but no,

source: …Tapi aku juga adalah anggota OSIS, apa sama sekali tidak ada yang bisa aku lakukan untuk membantu?
en: b-but... I’m also a member. isn’t there anything I can do to help?

source: SETIDAKNYA DALAM SITUASI BEGINI AKU TIDAK MEMBIARKAN CHIARA SENDIRIAN...
en: at least, I’ll be there for her if something bad happens to her.

source: SETELAH KAMI PERGI, KALIAN JUGA HARUS LANGSUNG BUBAR, MENGERTI?
en: once we leave, you two should dismiss immediately, understood?

source: Apa yang bisa dia dapatkan dengan memberitahu niatnya pada Leo..?
en: What could they gain by telling Leo their intentions?

source: bersalah…
en: so guilty...

source: Aku kasihan melihat anak-anak ini…
en: I pity those kids...

source: MENDENGAR SEDIKIT
en: to my story for

source: PEDULI KALAU SAMPAI
en: if anything

source: TAPI AKU MEMANG
en: But, I’m only

source: MEMANG TERKENAL
en: is known as

source: "DIA"…
en: “her”...

source: TAPI LAIN HALNYA
en: However,

source: OSIS MENGHUBUNGIKU
en: the president contacted

source: Tentu saja, festival memang waktu yang paling rawan terjadinya masalah…
en: of course! unexpected things often happen during the festival, so...

source: BAGAIMANA
en: How did

source: NASIHAT?
en: my advice?

source: TIDAK KUSANGKA KETUA
en: I didn’t expect that

source: …DAN KALAU
en: what if

source: ...SAAT INI AKU HANYA BISA DIAM DAN MENUNGGU INFO DARI NAOMI,
en: for now, I can only wait for naomi’s information.

source: DAN LEO AKAN BICARA DI
en: and Leo are talking

source: ...AKU BELUM MINTA MAAF SECARA LANGSUNG,
en: I need to apologize directly.

source: SAAT INI MEMBUATKU
en: reminds

source: identitas Ezra.
en: Ezra’s identity.

source: NAFAS SEKUAT ITU?
en: Are you okay?

source: CHIARA KALI INI,
en: may know...

source: ARTINYA SEMAKIN
en: it will

source: A-ANGGOTA OSIS
en: I thought that

source: penting??
en: of information!

source: APA SALAHKU??
en: What did I do wrong?

source: ...SEPERTI KATAKU TADI, AKU INGIN EKSTRA WASPADA.
en: like I said, I wanted to be extra cautious.

source: PERCAYA, AKAN MUDAH
en: between you two, there will only be

source: INI BUKAN HAL
en: I know

source: DAN DIA JUGA TERLIHAT SANGAT NATURAL SAAT MENYUSUN RENCANA UNTUK KASUS OSIS...
en: not to mention that he appears to be at ease as he plots out the strategy for osis’s case...

source: APA CHIARA SUDAH BENAR-BENAR MARAH PADAKU!??
en: is chiara really mad at me?!

source: TIDAK MEMEDULIKAN
en: care about

source: MASIH TETAP MAU
en: want to know

source: KELIHATAN CUKUP
en: seem pretty

source: sangat bersih ya.
en: surprisingly clean, huh?

source: MEMBERITAHU
en: tell you

source: PERASAAN SAYA
en: My feelings for you

source: DAN TIDAK MAU LAGI BERHUBUNGAN DENGAN A- KAMI.
en: and hate me... I mean hate us.

source: APA BOLEH BUAT KALAU
en: Oh, well,

source: SEBENTAR
en: moment,

source: Masih sibuk mengurus festival.
en: Still busy preparing for the festival.

source: JADI MEREKA SEBAIKNYA TIDAK TAHU SOAL INI.
en: so, it’s better to keep them in the dark.

source: Kau ini kebanyakan nonton film atau apa??
en: are you watching too many movies or what?

source: JADI, APA YANG KAU LAKUKAN UNTUK MENCEGAH 'NAK CHIARA BERHENTI?
en: so, what did you do to keep her from quitting?

source: APA SIH!??
en: huh?!

source: ATURAN SEKOLAH UNTUK
en: to defy the school’s order

source: DIRENCANAKAN MENJADI
en: meant to be

source: E-EEH!??
en: oh... hi!

source: Maaf ya, menculik anak-anak perempuan seperti kalian ini bukan hobi kami…
en: I’m sorry. kidnapping young girls like you isn’t really our thing...

source: Cuma kamu yang gak fokus.
en: you were the only one who got distracted.

source: MENYEMBUNYIKANNYA?
en: this up?

source: KITA TIDAK PERLU
en: not going

source: FAKTOR LAIN.
en: several factors that are also considered.

source: Aku 'kan
en: I haven’t

source: TEATER KE AUDITORIUM
en: to the auditorium

source: HANYA MAU BERGOSIP
en: you just wanted

source: BUKAN KARENA
en: for

source: TAPI BAGAIMANA BISA SAUDARA JAUH YANG JARANG BERINTERAKSI BISA PUNYA PEMBAWAAN YANG MIRIP..?
en: but how is it possible that two distant relatives who rarely interact could share the same aura?

source: JADI CHIARA, KARENA EZRA TERUS BERUSAHA MENGAJAKMU BICARA...
en: so chiara, you told ezra everything...

source: Vice Headmaster Office
en: Vice Headmaster’s Office

source: KAPAN DIA MAU
en: when is he planning

source: TIDAK SALING
en: OSIS members didn’t

source: ...SAYA MEMPERCAYAI KARAKTER ANGGOTA OSIS DAN SEKOLAH,
en: I believe in these guys and this school,

source: ...SEBENTAR YA, BIAR AKU BICARA DENGAN DIA.
en: wait, let me talk to him.

source: BRUK!
en: thud

source: SEMUANYA DENGAN
en: everything

source: ORANG STRESS
en: doofus doing

source: sekali, kalau tidak
en: If we didn’t know the truth,

source: HEDWIG SI
en: Hedwig

source: EZRA BERBUAT
en: something

source: Bu Nina kalau aku
en: that I have an

source: WAKTU SEPULANG
en: after

source: AKU MELIHAT ADA
en: seen someone who’s dared to

source: AKU SUDAH
en: There’s gotta be

source: BENAR JUGA, IDE YANG BAGUS
en: right, you have a point.

source: ITU SAJA AKU
en: so happy

source: TEMAN LAMA
en: The headmaster’s

source: HA-
en: Tsk

source: SEDANG BERJUANG
en: blinded

source: ISTRI SAYA JUGA SELALU BERKATA BEGITU.
en: my wife has always said that.

source: DIBICARAKAN.
en: for us to talk about.

source: HEEE KAKAK MAU
en: Whoa! You really want to

source: KALAU BICARA
en: You and that four-eyes are really

source: BASA-BASI DAN
en: beating around the bush

source: KE IBU SENDIRI,
en: you himself,

source: MEMINTA MEMBACAKAN
en: the following message to be

source: DI KURSI BIASA
en: at the usual

source: …APA
en: What did

source: ...NGOMONG-NGOMONG SOAL TADI,
en: oh, just out of curiosity...

source: SEKARANG TIAP
en: Now every time I

source: GAWAT, MEREKA NANTI MENDENGAR SUARA VIBRATE HP-KU!!
en: crap, they’ll hear the buzz from my phone!

source: MAAF KAK, TAPI
en: Sorry, but

source: MENYUKAI WAKIL
en: a crush on

source: Tidak, kamu diam saja di ruang Wakasek.
en: you don’t need to. just stay there.

source: TIDAK MENGETAHUI
en: doesn’t know

source: SI BODOH INI.
en: Look at this guy.

source: SUDAH TERLALU
en: is way

source: KAK?
en: Ezra?

source: UNTUK MENYELESAIKAN
en: to resolve his

source: …Benar apa yang Nevada katakan, Bagaimana pun juga, maksud 'Nak Ezra baik.
en: it’s true what nevada said. after all, you had a good intention.

source: MENUNGGU.
en: is wait.

source: SEPERTI APA PUN LATAR BELAKANG KELUARGA SANJAYA YANG KALIAN TEMUKAN,
en: no matter what you found out about the history of the sanjaya family,

source: Karena itu dia tau
en: Which is why she knows

source: TERAKHIRKU DI SMA!!
en: of high school!

source: TAPI AKU HARUS BICARA SESUATU YANG PENTING PADAMU JUGA...
en: but there’s something important I need to tell you...

source: ISTIRAHAT DI SINI?
en: break?

source: Kalau ketahuan
en: He’ll be in trouble

source: MELAKUKANNYA.
en: who does it.

source: EH, AKU ADA
en: Oh, wait, I’ve got

source: ADALAH SEPUPU DARI
en: of Ezra

source: SEBAGAI KAKAK ADIK YANG
en: Because they’re siblings

source: JADI ITU BENAR??
en: so, it’s true?

source: TAPI KAMI SANGAT
en: However, we’ve also

source: KAK EZRA,
en: Ezra,

source: EH MAAF, TAPI
en: Ah, sorry...

source: Terakhir kali, saya menyuruh Chiara untuk kembali ke ruang Wakasek bersama Cantika.
en: I told chiara to take cantika to the vice principal office.

source: TAHU LEBIH LANJUT,
en: that member.

source: OSIS DI SMA
en: At this school,

source: AKU SANGAT
en: I really

source: BUKAN ANGGOTA
en: that the culprit

source: MAUNYA
en: I

source: Jadi begini…
en: so...

source: BISA MEMPERCAYAI
en: trust

source: SESENANG INI!??
en: right now?!

source: T-TIDAK, TENTU SAJA BUKAN!
en: n-no, of course not!

source: TERNYATA
en: so...

source: DIABAIKAN SAAT
en: Being ignored

source: AKU SENANG SIH, BISA BERTEMU DENGAN CHIARA, TAPI KALAU DENGAN KONDISI HARUS BERSEMBUNYI SEPERTI INI, SIH...
en: even though seeing chiara’s face is nice, do I really have to hide like this every time I want to?

source: KARENA APA YANG
en: No matter what we do

source: AKU SELALU
en: I

source: KAPAN??
en: we?

source: BERSIKAP BAIK
en: being nice

source: IBU NINA..?
en: her voice?

source: SOSIALITA TERKENAL,
en: of a very popular figure.

source: MEMANG SUDAH
en: still

source: Aku akan kembali ke ruang Wakasek
en: I’ll be back to the vice principal office.

source: ORANG
en: Hmm... just what kind of a person

source: ADALAH SEORANG
en: is a student

source: TERBARU APA
en: any updates

source: Ngapain aku, menunjukkan sisi burukku di depan Chiara??
en: crap, why did I expose my dumb side in front of chiara?

source: TAHU SEMUANYA?
en: about everything?

source: INI…
en: his motives.

source: Sepertinya dia orang yang haus perhatian, tidakkah mau mereka begitu?
en: I think they’re an attention seeker, don’t you think so?

source: …DENGAN KATA
en: In other

source: ADA APA NIH,
en: Rough

source: BISA MEMBIMBING
en: you can guide

source: WAKTU DIA MERAGUKAN
en: before she starts to

source: Maksud Kakak…
en: do you mean...

source: Taman Menara Jam, ruang rahasia OSIS.
en: clock tower park, osis’s secret base

source: Benar…Mereka mengingatkanku dengan anak perempuanku di rumah.
en: right... they remind me of my daughter at home.

source: Sepatu
en: a shoe

source: WAKTU JADI SAYA
en: so let’s just

source: DANGKAL?
en: real.

source: TENTANG KETUA
en: from the president

source: ADA DI SAMPINGKU TAPI TIDAK
en: who’s always been on my side,

source: JARANG SEKALI AKU MENEMUKAN ANAK REMAJA SEPERTI INI.
en: I rarely see a teenager like her.

source: MELAKUKAN BANYAK
en: we’ve taken

source: A-AWAS YA KAU
en: You’d better

source: PERTEMUAN,
en: as their meeting place.

source: YANG INGIN TAHU SOAL
en: wanted to know about

source: SAMA.
en: the same thing.

source: AKU
en: I’ll

source: SAYA AKAN
en: I will tell

source: AKU MERASA
en: I’ve got a feeling

source: DI SINI!??
en: on here?!

source: SITUASINYA.
en: situation.

source: DENGAN KAKAK?
en: my trust in you?

source: Ada apa?
en: h-huh?

source: AYO CEPAT KITA
en: Let’s finish this

source: MIRIP BU NINA?
en: very similar stature?

source: MENGAMBIL HATI
en: flirt

source: Si kacamata?
en: four-eyes?

source: AWALNYA DIA TIDAK
en: she wasn’t

source: AKU INGIN MENANYAKAN
en: I want to

source: Kau sama saja tau??
en: you’re just like me, you know?

source: juga!
en: Naomi into this!

source: Itu 'kan..!!?
en: that’s...?!

source: SEBAGAI "KETUA OSIS"
en: OSIS should

source: BAGAIMANA CARA MENANYAKAN "APAKAH BAPAK PENJAHAT?"
en: but it’s not like we can just ask him if he’s a bad guy

source: RENCANA LEO.
en: Leo’s plan.

source: MEMBATU
en: shocked

source: malu
en: flustered

source: SAMA LAGI.
en: now.

source: AKU BARU TAHU
en: I didn’t

source: DENGAN BEGITU PENGUSAHA BISA MENDAPAT KEUNTUNGAN SEPERTI AKSES UNTUK MENDAPAT IJIN USAHA, MENGHINDARI PAJAK, BAHKAN MENGOPERASIKAN BISNIS RAHASIA.
en: that way, they can get benefits like getting more accessible access to expand their business, evading taxes, or even operating hidden businesses.

source: TCK!
en: Tsk

source: KARENA SI GANJEN
en: this mess if it wasn’t for

source: YAH, KALAU
en: well, if i

source: KAU YANG BARU PERTAMA
en: Isn’t this the first time

source: Dia datang sebagai murid beasiswa, itu saja sudah menjadikan Chiara berbeda.
en: she’s a scholarship holder. that alone makes her different.

source: AKU TERPAKSA
en: I had

source: DAN PEMBICARAAN INI
en: Eventually,

source: Diganti menjadi lakban
en: replaced it with tape

source: akan percaya.
en: she’ll believe you.

source: APA INI??
en: into?!

source: Sekarang apa yang harus aku lakukan?
en: what do I do now?

source: Apalagi ke perempuan.
en: especially women.

source: PERLU BERTERIMA
en: to say thank you

source: Siapapun orangnya, sepertiya dia bukan orang yang akan melakukan tindakan dengan sembarangan…
en: whoever it is, I think they’re not someone who acts recklessly.

source: SEMUA BERHENTI
en: acting and

source: TAPI SAYA TIDAK TAHU PAK ARDHAN TERMASUK DI DALAMNYA.
en: but I had no idea that mr. ardhan had business dealings with them.

source: S-Saya sudah memeriksa CCTV yang ada,
en: I-I’ve checked the cctv footage, and...

source: TUJUANNYA MELAKUKAN
en: to uncover

source: JADI AKU MEMUTUSKAN UNTUK TIDAK TERLALU MEMIKIRKANNYA...
en: I’ve decided to put it out of my mind.

source: LAMA JUGA
en: Not too bad for

source: SALAH SATUNYA MELALUI
en: both of you need to

source: KEPALA KELUARGA SANJAYA ADALAH SALAH SATU ORANG YANG MENGAMBIL ANDIL BESAR DALAM MENDONGKRAK KARIR PAK ARDHAN KEMBALI.
en: ...I found out that the sanjaya family was one of the reasons why mr. ardhan could bounce back from his failure.

source: LAIN, KAMU
en: words,

source: MENDAPATKAN
en: to

source: SEJAK KAPAN
en: Since when

source: Sudah tidak
en: I thought

source: APA YANG TERJADI
en: it

source: SEJAK AWAL KAMI
en: from the beginning,

source: ADA YANG
en: called

source: SEBENARNYA.
en: the truth.

source: Saya menemukan mereka memasuki mobil van abu-abu bersama dua pria tidak dikenal,
en: ...I saw them getting into a gray van with two unknown men.

source: PUNYA TEORI YANG
en: thinking

source: semuanya dengan baik?
en: prepared everything?

source: NYONYA BESAR,
en: madam...

source: SALAM!
en: will!

source: NGOMONG-
en: Oh,

source: DIRI,
en: alone...

source: TAPI IMAJINASIMU SEPERTINYA TERLALU BERLEBIHAN.
en: but you’re imagination is too wild.

source: TAPI SETIDAKNYA,
en: But, still,

source: E-EH??
en: H-huh?

source: KALAU KAU
en: If only

source: Kantor Wakil Kepala Sekolah
en: (redacted)

source: MURID YANG DIMAKSUD
en: Leo

source: AJAR!!!
en: Naomi!!!

source: BERAKTING!!
en: you doofus!

source: MASALAH INI, AKU JADI
en: the investigation,

source: HAL APA?
en: into?

source: K-KAK
en: E-Ezra...

source: Sepertinya tidak apa-apa kita melepaskan penutup mata dan mulut mereka, toh mereka tidak akan bisa kabur juga?
en: I think it’s okay to take off their blindfolds and mouth covers since they can’t go anywhere.

source: DI AUDITORIUM,
en: auditorium,

source: begitu.
en: really red.

source: ATAU PURA-PURA,
en: are you pretending

source: teater.
en: about this.

source: UNTUKNYA!!
en: pay!

source: KEBALIKAN
en: not like

source: SALAH.
en: off the mark.

source: SEPERTINYA
en: I guess

source: SAYA MEMINTAMU
en: I want you to

source: EZRA KENAL DENGAN
en: knows

source: NGOMONG,
en: anyway,

source: AKU RELA MELAWAN
en: I’m willing

source: BERKATA-KATA
en: do you mean “it can’t

source: DAN AKU JUGA TAHU KALAU SEBENARNYA KAKAK DISURUH UNTUK MEMBERITAHUKU,
en: I know that you were supposed to tell me the truth...

source: LEO MENGATAKAN
en: What he said to me

source: AKU MENDAPATKAN
en: I got this

source: Kasihan, dia
en: He must be

source: SUDAH MENYEBARKAN KE
en: I would’ve already told

source: …APA BENAR
en: Are we really

source: BAIK, PAK.
en: you got it, sir.

source: TADI SANGAT TAJAM
en: really furious

source: SIAPAPUN, CHIARA.
en: anyone, chiara.

source: PASTI PERNAH
en: need to

source: HA… LIHAT
en: Tsk...

source: DENGAN KAK LEO UNTUK
en: with Leo

source: DI DEPAN WAKATOS.
en: in front of the vice president.

source: TIDAK HANYA ITU,
en: Not only that,

source: alasan untuk
en: my reasons,

source: MELAKUKANNYA…
en: no choice...

source: UKH… DIA
en: Whoa... she’s

source: SITUASI INI UNTUK
en: just to blackmail

source: GAWAT, AKU INI BICARA APA!??
en: damn, why did I say that?!

source: BEGITU?
en: I see.

source: DAN SEBENARNYA,
en: Truthfully,

source: (Lihat episode 38).
en: (see episode 38)

source: AKU RASA TIDAK MUNGKIN KEPSEK TIDAK TAHU SOAL INI.
en: he must know something.

source: MELAKUKAN ITU??
en: do that?

source: TERLIBAT DENGAN
en: in this mess

source: Kami memang berhati rapuh, tapi kami tidak boodoh.
en: we’re indeed soft, but we’re not foolish.

source: LAGIPULA AKU
en: Besides,

source: turut.
en: messages.

source: HAAHH…
en: Huff...

source: Ah benar, 20 panggilan tak terjawab!
en: wow, 20 missed calls!

source: MEMBERITAHUMU.
en: you.

source: gugup.
en: when he’s nervous.

source: E-EH!??
en: Huh???

source: minta Wakatos ke
en: her to the

source: WALAUPUN SEPERTINYA MEREKA SAUDARA JAUH SIH.
en: though I don’t think they’re close relatives.

source: SANGAT PERASA,
en: sentimental.

source: BACA PIKIRAN, YA?!
en: He can read my mind too?!

source: TERLALU MENUNJUKKAN
en: restrain

source: LEO?
en: the informant from the recording?

source: Kasihan.
en: that’s sad.

source: BEGITULAH
en: that sums

source: BOHONG,
en: lying to me.

source: SESEORANG
en: Nobody can just

source: TADI KAMI BERPAPASAN DENGAN NAOMI,
en: we just ran into naomi,

source: BAHKAN BISA
en: Even OSIS

source: PERTANYAAN DI
en: so many

source: TAPI AKU SANGAT TERKEJUT KARENA TERNYATA KAMU TIDAK...
en: but I was surprised to find out that you weren’t--

source: PENTING UNTUK
en: to know

source: DIBIARKAN DALAM
en: keep her in

source: kembali
en: return

source: sudah…
en: over...

source: KAU PIKIR
en: That’s rich

source: BENAR,
en: yes.

source: IDENTITASKU PADAMU
en: identity,

source: PIK
en: grim

source: Fokus dengan masalah yang ada saat ini.
en: just focus on what’s happening right now.

source: Kecilkan
en: Lower your

source: ANAK GILA TEATER
en: like him usually

source: TERJADI, HAH?
en: happening, huh?!

source: A-AKU...
en: I-I...

source: bicara berdua
en: conversation alone,

source: DAN SAAT INI,
en: I think

source: BOLEH AKU
en: May I sit

source: WAH… BARU
en: Whoa...

source: ISTIRAHAT.
en: your break time, everyone.

source: MENYUKAI
en: I do something

source: CERMIN?
en: Ezra?

source: pasti harus
en: need to have this

source: KAMU, CHIARA.
en: chiara.

source: TIDAK...
en: oh no...

source: DENGAN ORANG
en: cared about

source: BISA SEGERA
en: quickly come over to

source: MENGATAKAN SEMUA INI
en: and he started to tell you

source: Jangan bilang ini
en: Don’t tell me

source: PALING TIDAK
en: You need to

source: JU
en: ch

source: OSIS.
en: the president of OSIS.

source: SEMUA TERJADI
en: to happen

source: GAWAT, AKU
en: Darn it, I

source: WAKIL KETUA OSIS?
en: as the vice president of OSIS?

source: KEHENDAK ORANG.
en: someone’s will.

source: RELA MELANGGAR
en: school rules

source: Kebanyakan
en: We aren’t in

source: itu tugasnya
en: should be the ones

source: TIDAK BISA, FESTIVAL SEKOLAH SUDAH DIUJUNG MATA.
en: nope, the school festival is around the corner.

source: SETIDAKNYA
en: you need to at least

source: SESUATU PADA KAKAK…
en: ask you something...

source: *Sekolah curiga orang itu adalah Kevin, tapi dia tidak mengakuinya dan kamu belum punya bukti.
en: The school suspects that person is Kevin, but he doesn't admit it and we don't have any proof yet.

source: Ketua??
en: President???

source: SEDANGKAN AKU
en: Meanwhile,

source: BIARPUN KEVIN SUDAH MENGENAL CHIARA SEBELUMNYA,
en: even though kevin already knows chiara,

source: PERASAAN SIMPATI CHIARA AKAN MELEBIHI KEMARAHANNYA, DAN MEMBUATNYA TETAP BERSEDIA ADA DI OSIS.
en: then, chiara’s sympathy would triumph over her rage, keeping her in osis.

source: BENAR...
en: yeah...

source: AKU MELAKUKANNYA KARENA AKU PERCAYA DENGAN VISI SEKOLAH INI,
en: I stay because I believe in this school’s vision.

source: Tapi aku tidak mau kejadian Erlangga terulang lagi.
en: but I don’t want what happened to erlangga to happen again.

source: Berusaha akting sebaik mungkin.
en: put the best act

source: DIA KEBINGUNGAN…
en: confused!

source: AKU SETUJU DENGAN KALIAN SEMUA.
en: sure, I agree with you.

source: BERLAMA-LAMA.
en: for long.

source: WAJAR, KAN?
en: So, it’s okay if I’m like this to you, right?

source: KARENA ITU AKU MEMINTAMU UNTUK MENCARI INFORMASI TENTANG DIA.
en: that’s why I need you to find out more about him.

source: Salah satu contohnya.
en: ...one of those.

source: SAYA BARU SAJA
en: got some new
